#### Terraform Plan 📋
```
module.document_processor.data.archive_file.generate_embeddings: Reading...
module.auth.data.archive_file.login: Reading...
module.vector_store_init.data.archive_file.init_index: Reading...
module.websocket_handlers.data.archive_file.disconnect: Reading...
module.agent.data.archive_file.mcp_servers: Reading...
module.document_processor.data.archive_file.lambda_layer: Reading...
module.document_management.data.archive_file.list: Reading...
module.document_management.data.archive_file.delete: Reading...
module.auth.data.archive_file.logout: Reading...
module.agentcore.data.archive_file.gateway_tools: Reading...
module.auth.data.archive_file.logout: Read complete after 3s [id=2e7b6f7480f8a2690a24f76080cdcb258f96d94c]
module.opensearch_access_config.data.archive_file.configure_access: Reading...
module.websocket_handlers.data.archive_file.disconnect: Read complete after 3s [id=50387cc307daebbf24c80da1cd3bc6a61d28ffb1]
module.chat_history.data.archive_file.chat_history: Reading...
module.agent.data.archive_file.mcp_servers: Read complete after 7s [id=bd63045c18d710985b52624db1f75127e498e17a]
module.auth.data.archive_file.authorizer: Reading...
module.agentcore.data.archive_file.gateway_tools: Read complete after 7s [id=b36554c373fab970768c4cb7ccce3c195e64606f]
module.document_processor.data.archive_file.document_processor: Reading...
module.document_processor.data.archive_file.document_processor: Read complete after 0s [id=618afbb7eb17c0c2db1c189358d90f5980240124]
module.document_management.data.archive_file.upload: Reading...
module.vector_store_init.data.archive_file.init_index: Read complete after 7s [id=165eb67dfbf52f4b50002b320d8c4558fc871d93]
module.websocket_handlers.data.archive_file.message: Reading...
module.document_processor.data.archive_file.generate_embeddings: Read complete after 8s [id=195d95c0726d6b80d140f8bbe2a043bf2c822faf]
module.document_management.data.archive_file.list: Read complete after 8s [id=693d19f01b57af5c93d2ca742113df6e62cd94c1]
module.websocket_handlers.data.archive_file.connect: Reading...
module.rest_api.aws_api_gateway_rest_api.chatbot: Refreshing state... [id=gv1ucj9hg9]
module.security.aws_iam_role.lambda_execution: Refreshing state... [id=dev-lambda-execution-20260225173614468800000002]
module.auth.data.archive_file.login: Read complete after 8s [id=90e8c2c69097133f02c07c34c1cc064a1aaa3ac8]
module.rest_api.aws_iam_role.api_gateway_authorizer: Refreshing state... [id=dev-api-gateway-authorizer-role]
module.document_management.data.archive_file.delete: Read complete after 8s [id=07941a659aeec955499aab11bdd0c374b291c514]
module.document_processor.data.archive_file.lambda_layer: Read complete after 8s [id=133ca84a6b0c582470310dcef669b74ccd359d1b]
module.rest_api.aws_cloudwatch_log_group.api_logs: Refreshing state... [id=/aws/apigateway/dev-chatbot-api]
module.networking.data.aws_region.current: Reading...
module.networking.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.opensearch.data.aws_caller_identity.current: Reading...
module.opensearch.data.aws_caller_identity.current: Read complete after 0s [id=177981160483]
module.auth.aws_iam_role.logout_role: Refreshing state... [id=dev-logout-lambda-role]
module.document_management.aws_iam_role.upload_role: Refreshing state... [id=dev-document-upload-lambda-role]
module.websocket.aws_cloudwatch_log_group.websocket_logs: Refreshing state... [id=/aws/apigateway/dev-websocket]
module.security.aws_kms_key.main: Refreshing state... [id=5464812d-92bc-4993-9605-984d3b23623e]
module.opensearch_access_config.aws_iam_role.configure_access_role: Refreshing state... [id=dev-opensearch-configure-access-role]
module.security.aws_iam_policy.lambda_bedrock: Refreshing state... [id=arn:aws:iam::177981160483:policy/dev-lambda-bedrock-20260302132851282200000003]
module.websocket_handlers.aws_iam_role.message_role: Refreshing state... [id=dev-websocket-message-role]
module.vector_store_init.aws_iam_role.init_index_role: Refreshing state... [id=dev-vector-store-init-role]
module.security.aws_iam_role.api_gateway: Refreshing state... [id=dev-api-gateway-20260302132851022400000002]
data.aws_secretsmanager_secret_version.jwt_secret: Reading...
module.websocket.aws_apigatewayv2_api.websocket: Refreshing state... [id=ftj9zrh5h0]
module.agentcore.data.aws_caller_identity.current: Reading...
module.agentcore.data.aws_caller_identity.current: Read complete after 0s [id=177981160483]
module.frontend.aws_cloudfront_origin_access_identity.frontend: Refreshing state... [id=E1BXN7WBAHV36H]
module.monitoring.aws_cloudwatch_log_group.audit_user_actions: Refreshing state... [id=/aws/lambda/chatbot/audit/user-actions]
data.aws_secretsmanager_secret_version.jwt_secret: Read complete after 0s [id=/chatbot/jwt-secret|AWSCURRENT]
module.chat_history.aws_iam_role.chat_history: Refreshing state... [id=dev-chatbot-chat-history-role]
module.auth.aws_iam_role.authorizer_role: Refreshing state... [id=dev-authorizer-lambda-role]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0931aca004f158fd9]
data.aws_caller_identity.current: Reading...
module.rest_api.aws_cloudwatch_log_group.waf_logs[0]: Refreshing state... [id=aws-waf-logs-dev-chatbot-api]
data.aws_caller_identity.current: Read complete after 0s [id=177981160483]
module.document_management.aws_iam_role.list_role: Refreshing state... [id=dev-document-list-lambda-role]
module.vector_store_init.data.aws_caller_identity.current: Reading...
module.vector_store_init.data.aws_caller_identity.current: Read complete after 0s [id=177981160483]
module.rest_api.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=dev-api-gateway-cloudwatch-role]
module.document_management.aws_iam_role.delete_role: Refreshing state... [id=dev-document-delete-lambda-role]
module.vector_store_init.data.aws_region.current: Reading...
module.vector_store_init.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.agentcore.aws_iam_role.gateway_tools_role: Refreshing state... [id=dev-agentcore-gateway-tools-role]
module.document_processor.aws_iam_role.generate_embeddings: Refreshing state... [id=dev-chatbot-generate-embeddings-role]
module.agentcore.aws_iam_role.memory_role: Refreshing state... [id=dev-agentcore-memory-role]
module.monitoring.aws_cloudwatch_log_group.audit_document_operations: Refreshing state... [id=/aws/lambda/chatbot/audit/document-operations]
module.notifications.data.aws_caller_identity.current: Reading...
module.monitoring.aws_cloudwatch_log_group.lambda_document_processor: Refreshing state... [id=/aws/lambda/dev-chatbot-document-processor]
module.notifications.data.aws_caller_identity.current: Read complete after 0s [id=177981160483]
module.document_processor.aws_iam_role.document_processor: Refreshing state... [id=dev-chatbot-document-processor-role]
module.agent.aws_iam_role.agent_execution_role: Refreshing state... [id=dev-agent-execution-role]
module.security.aws_iam_policy.lambda_elasticache: Refreshing state... [id=arn:aws:iam::177981160483:policy/dev-lambda-elasticache-20260302132849439900000001]
module.websocket_handlers.aws_iam_role.disconnect_role: Refreshing state... [id=dev-websocket-disconnect-role]
module.agent.aws_iam_role.mcp_servers_role: Refreshing state... [id=dev-agent-mcp-servers-lambda-role]
module.websocket_handlers.data.aws_region.current: Reading...
module.websocket_handlers.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.cache.aws_elasticache_parameter_group.redis: Refreshing state... [id=dev-chatbot-redis-params]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-2]
module.auth.aws_iam_role.login_role: Refreshing state... [id=dev-login-lambda-role]
module.opensearch.data.aws_region.current: Reading...
module.opensearch.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.networking.data.aws_ami.amazon_linux_2023[0]: Reading...
module.websocket_handlers.aws_iam_role.connect_role: Refreshing state... [id=dev-websocket-connect-role]
module.auth.data.archive_file.authorizer: Read complete after 3s [id=4988fcf0cf73fbb77b933317a4895928346471d0]
module.agentcore.data.aws_region.current: Reading...
module.agentcore.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.monitoring.aws_cloudwatch_log_group.audit_api_calls: Refreshing state... [id=/aws/lambda/chatbot/audit/api-calls]
module.rest_api.aws_api_gateway_resource.agent: Refreshing state... [id=stnzod]
module.rest_api.aws_api_gateway_request_validator.all_validator: Refreshing state... [id=lw7rlp]
module.rest_api.aws_api_gateway_resource.auth: Refreshing state... [id=7w2mcy]
module.rest_api.aws_api_gateway_model.upload_request: Refreshing state... [id=jchnj7]
module.rest_api.aws_api_gateway_resource.documents: Refreshing state... [id=fu4c5j]
module.rest_api.aws_api_gateway_request_validator.params_validator: Refreshing state... [id=zryedx]
module.rest_api.aws_api_gateway_model.login_response: Refreshing state... [id=nfnmf4]
module.rest_api.aws_api_gateway_model.upload_response: Refreshing state... [id=933u93]
module.rest_api.aws_api_gateway_resource.chat: Refreshing state... [id=ujwc76]
module.rest_api.aws_api_gateway_model.error_response: Refreshing state... [id=dth5lv]
module.rest_api.aws_api_gateway_request_validator.body_validator: Refreshing state... [id=ut5rth]
module.rest_api.aws_api_gateway_model.login_request: Refreshing state... [id=jie8s1]
module.security.aws_iam_role_policy_attachment.lambda_vpc_execution: Refreshing state... [id=dev-lambda-execution-20260225173614468800000002-20260302132852034100000006]
module.security.aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=dev-lambda-execution-20260225173614468800000002-20260302132852048000000008]
module.security.aws_kms_alias.main: Refreshing state... [id=alias/dev-chatbot]
module.security.aws_iam_policy.lambda_kms: Refreshing state... [id=arn:aws:iam::177981160483:policy/dev-lambda-kms-20260302132851715500000004]
module.security.aws_iam_role_policy_attachment.lambda_bedrock: Refreshing state... [id=dev-lambda-execution-20260225173614468800000002-2026030213285251280000000e]
module.security.aws_iam_role_policy_attachment.api_gateway_cloudwatch: Refreshing state... [id=dev-api-gateway-20260302132851022400000002-2026030213285243630000000d]
module.websocket.aws_apigatewayv2_stage.websocket: Refreshing state... [id=dev]
module.rest_api.aws_iam_role_policy_attachment.api_gateway_cloudwatch: Refreshing state... [id=dev-api-gateway-cloudwatch-role-20260302140552360100000003]
module.rest_api.aws_api_gateway_account.main: Refreshing state... [id=api-gateway-account]
module.document_management.aws_iam_role_policy_attachment.delete_vpc_execution: Refreshing state... [id=dev-document-delete-lambda-role-20260302132851823900000005]
module.networking.data.aws_ami.amazon_linux_2023[0]: Read complete after 0s [id=ami-075a156f1500285e1]
module.networking.aws_security_group.vpc_endpoints: Refreshing state... [id=sg-0ba2f38e49ca297f0]
module.chat_history.data.archive_file.chat_history: Read complete after 7s [id=794e709c36ee16dd159e620c8f0194f96bb38af9]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-008918b3cb55d47ba]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-06c0ad86f88009604]
module.networking.aws_subnet.private[2]: Refreshing state... [id=subnet-07d59f4c2a739367e]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-0105b8dbfa5e92713]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-085cfdbb80e96ea90]
module.networking.aws_subnet.public[2]: Refreshing state... [id=subnet-0e5fb4d93319b6a82]
module.networking.aws_security_group.nat_instance[0]: Refreshing state... [id=sg-00df608c78a6b1217]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-0ffe66b9c6cbe6275]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-0eee92df5d5a6712b]
module.security.aws_iam_role_policy_attachment.lambda_elasticache: Refreshing state... [id=dev-lambda-execution-20260225173614468800000002-20260302132852048000000007]
module.monitoring.aws_cloudwatch_dashboard.system_monitoring: Refreshing state... [id=dev-chatbot-system-monitoring]
module.rest_api.aws_api_gateway_resource.mcp_servers: Refreshing state... [id=7okatu]
module.rest_api.aws_api_gateway_resource.logout: Refreshing state... [id=jnnedc]
module.rest_api.aws_api_gateway_resource.login: Refreshing state... [id=iwuklo]
module.rest_api.aws_api_gateway_resource.documents_id: Refreshing state... [id=z89vc1]
module.rest_api.aws_api_gateway_method.documents_options: Refreshing state... [id=agm-gv1ucj9hg9-fu4c5j-OPTIONS]
module.rest_api.aws_api_gateway_resource.documents_upload: Refreshing state... [id=uc8stx]
module.rest_api.aws_api_gateway_resource.chat_history: Refreshing state... [id=flm1kk]
module.agentcore.aws_iam_role.gateway_role: Refreshing state... [id=dev-agentcore-gateway-role]
module.agentcore.aws_iam_role.runtime_role: Refreshing state... [id=dev-agentcore-runtime-role]
module.security.aws_iam_role_policy_attachment.lambda_kms: Refreshing state... [id=dev-lambda-execution-20260225173614468800000002-20260302140551991800000002]
module.networking.aws_vpc_endpoint.bedrock: Refreshing state... [id=vpce-096d1c144cf130b52]
module.networking.aws_vpc_endpoint.bedrock_agent_runtime: Refreshing state... [id=vpce-06499276d03052d67]
module.networking.aws_instance.nat[0]: Refreshing state... [id=i-0c0083815262a5e25]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-0465022e79197d92b]
module.rest_api.aws_api_gateway_method.mcp_servers_options: Refreshing state... [id=agm-gv1ucj9hg9-7okatu-OPTIONS]
module.rest_api.aws_api_gateway_resource.mcp_servers_name: Refreshing state... [id=h71wsf]
module.rest_api.aws_api_gateway_method.logout_options: Refreshing state... [id=agm-gv1ucj9hg9-jnnedc-OPTIONS]
module.rest_api.aws_api_gateway_method.login_options: Refreshing state... [id=agm-gv1ucj9hg9-iwuklo-OPTIONS]
module.rest_api.aws_api_gateway_method.login: Refreshing state... [id=agm-gv1ucj9hg9-iwuklo-POST]
module.rest_api.aws_api_gateway_method_response.documents_options: Refreshing state... [id=agmr-gv1ucj9hg9-fu4c5j-OPTIONS-200]
module.rest_api.aws_api_gateway_integration.documents_options: Refreshing state... [id=agi-gv1ucj9hg9-fu4c5j-OPTIONS]
module.rest_api.aws_api_gateway_method.documents_id_options: Refreshing state... [id=agm-gv1ucj9hg9-z89vc1-OPTIONS]
module.database.aws_dynamodb_table.users: Refreshing state... [id=dev-chatbot-users]
module.notifications.aws_sns_topic.system_alerts: Refreshing state... [id=arn:aws:sns:us-east-2:177981160483:dev-chatbot-system-alerts]
module.notifications.aws_sns_topic.operational_notifications: Refreshing state... [id=arn:aws:sns:us-east-2:177981160483:dev-chatbot-operational-notifications]
module.rest_api.aws_wafv2_web_acl.api_gateway[0]: Refreshing state... [id=d7bee265-19cd-421c-babc-6aeb894a3042]
module.database.aws_dynamodb_table.chat_history: Refreshing state... [id=dev-chatbot-chat-history]
module.database.aws_dynamodb_table.mcp_server_config: Refreshing state... [id=dev-chatbot-mcp-server-config]
module.notifications.aws_sns_topic.failed_processing: Refreshing state... [id=arn:aws:sns:us-east-2:177981160483:dev-chatbot-failed-processing]
module.database.aws_dynamodb_table.document_metadata: Refreshing state... [id=dev-chatbot-document-metadata]
module.database.aws_dynamodb_table.sessions: Refreshing state... [id=dev-chatbot-sessions]
module.database.aws_dynamodb_table.rate_limits: Refreshing state... [id=dev-chatbot-rate-limits]
module.agentcore.aws_ecr_repository.agent: Refreshing state... [id=dev-agentcore-runtime]
module.agentcore.aws_iam_role_policy.memory_policy: Refreshing state... [id=dev-agentcore-memory-role:dev-agentcore-memory-policy]
module.agentcore.aws_bedrockagentcore_memory.this: Refreshing state... [id=dev_agentcore_memory-i5bLkYCVKx]
module.database.aws_dynamodb_table.connections: Refreshing state... [id=dev-chatbot-connections]
module.rest_api.aws_api_gateway_method.documents_upload_options: Refreshing state... [id=agm-gv1ucj9hg9-uc8stx-OPTIONS]
module.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-07bf9f899bf7ce2ae]
module.networking.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0c2a42be1cc626dc7]
module.networking.aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0b3bcf7704432ae3c]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07e3c7246b98cebfe]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-030baa577d13811a8]
module.rest_api.aws_api_gateway_method.chat_history_options: Refreshing state... [id=agm-gv1ucj9hg9-flm1kk-OPTIONS]
module.security.aws_iam_policy.api_gateway_lambda: Refreshing state... [id=arn:aws:iam::177981160483:policy/dev-api-gateway-lambda-2026030213285224560000000b]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=dev-chatbot-frontend-177981160483]
module.storage.aws_s3_bucket.documents: Refreshing state... [id=dev-chatbot-documents-177981160483]
module.security.aws_iam_policy.lambda_s3: Refreshing state... [id=arn:aws:iam::177981160483:policy/dev-lambda-s3-2026030213285217270000000a]
module.security.aws_iam_policy.lambda_opensearch: Refreshing state... [id=arn:aws:iam::177981160483:policy/dev-lambda-opensearch-20260302132852148600000009]
module.security.aws_iam_policy.lambda_dynamodb: Refreshing state... [id=arn:aws:iam::177981160483:policy/dev-lambda-dynamodb-2026030213285225050000000c]
module.security.aws_security_group.lambda: Refreshing state... [id=sg-0793301d8deea18f6]
module.rest_api.aws_api_gateway_integration.mcp_servers_options: Refreshing state... [id=agi-gv1ucj9hg9-7okatu-OPTIONS]
module.rest_api.aws_api_gateway_method_response.mcp_servers_options: Refreshing state... [id=agmr-gv1ucj9hg9-7okatu-OPTIONS-200]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07d9d179ddef670c2]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-068b097695ebca9f7]
module.networking.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0c1cce556f0d60024]
module.rest_api.aws_api_gateway_method.mcp_servers_name_options: Refreshing state... [id=agm-gv1ucj9hg9-h71wsf-OPTIONS]
module.rest_api.aws_api_gateway_integration.logout_options: Refreshing state... [id=agi-gv1ucj9hg9-jnnedc-OPTIONS]
module.rest_api.aws_api_gateway_method_response.logout_options: Refreshing state... [id=agmr-gv1ucj9hg9-jnnedc-OPTIONS-200]
module.rest_api.aws_api_gateway_integration.login_options: Refreshing state... [id=agi-gv1ucj9hg9-iwuklo-OPTIONS]
module.rest_api.aws_api_gateway_method_response.login_options: Refreshing state... [id=agmr-gv1ucj9hg9-iwuklo-OPTIONS-200]
module.rest_api.aws_api_gateway_integration.documents_id_options: Refreshing state... [id=agi-gv1ucj9hg9-z89vc1-OPTIONS]
module.rest_api.aws_api_gateway_method_response.documents_id_options: Refreshing state... [id=agmr-gv1ucj9hg9-z89vc1-OPTIONS-200]
module.notifications.aws_sns_topic_policy.system_alerts: Refreshing state... [id=arn:aws:sns:us-east-2:177981160483:dev-chatbot-system-alerts]
module.notifications.aws_sns_topic_policy.operational_notifications: Refreshing state... [id=arn:aws:sns:us-east-2:177981160483:dev-chatbot-operational-notifications]
module.database.aws_dynamodb_table_item.mcp_seed_serpapi: Refreshing state... [id=dev-chatbot-mcp-server-config|PK|MCP#serpapi|CONFIG]
module.notifications.aws_sns_topic_policy.failed_processing: Refreshing state... [id=arn:aws:sns:us-east-2:177981160483:dev-chatbot-failed-processing]
module.agentcore.aws_iam_role_policy.runtime_policy: Refreshing state... [id=dev-agentcore-runtime-role:dev-agentcore-runtime-policy]
module.agentcore.null_resource.push_runtime_image: Refreshing state... [id=1257521323572816183]
module.rest_api.aws_api_gateway_integration.documents_upload_options: Refreshing state... [id=agi-gv1ucj9hg9-uc8stx-OPTIONS]
module.rest_api.aws_api_gateway_method_response.documents_upload_options: Refreshing state... [id=agmr-gv1ucj9hg9-uc8stx-OPTIONS-200]
module.rest_api.aws_api_gateway_method_response.chat_history_options: Refreshing state... [id=agmr-gv1ucj9hg9-flm1kk-OPTIONS-200]
module.rest_api.aws_api_gateway_integration.chat_history_options: Refreshing state... [id=agi-gv1ucj9hg9-flm1kk-OPTIONS]
module.networking.aws_route.private_nat_instance[0]: Refreshing state... [id=r-rtb-0ffe66b9c6cbe62751080289494]
module.security.aws_iam_role_policy_attachment.api_gateway_lambda: Refreshing state... [id=dev-api-gateway-20260302132851022400000002-20260302132856174300000010]
module.security.aws_iam_role_policy_attachment.lambda_opensearch: Refreshing state... [id=dev-lambda-execution-20260225173614468800000002-20260302140552650600000005]
module.security.aws_iam_role_policy_attachment.lambda_s3: Refreshing state... [id=dev-lambda-execution-20260225173614468800000002-20260302140552620900000004]
module.cache.aws_elasticache_subnet_group.redis: Refreshing state... [id=dev-chatbot-redis-subnet-group]
module.opensearch_access_config.data.archive_file.configure_access: Still reading... [00m10s elapsed]
module.security.aws_iam_role_policy_attachment.lambda_dynamodb: Refreshing state... [id=dev-lambda-execution-20260225173614468800000002-20260302140552726600000006]
module.security.aws_security_group.opensearch: Refreshing state... [id=sg-0c6ed2d2f8b73f6ae]
module.rest_api.aws_api_gateway_method_response.mcp_servers_name_options: Refreshing state... [id=agmr-gv1ucj9hg9-h71wsf-OPTIONS-200]
module.rest_api.aws_api_gateway_integration.mcp_servers_name_options: Refreshing state... [id=agi-gv1ucj9hg9-h71wsf-OPTIONS]
module.storage.aws_s3_bucket_versioning.documents: Refreshing state... [id=dev-chatbot-documents-177981160483]
module.storage.aws_s3_bucket_public_access_block.documents: Refreshing state... [id=dev-chatbot-documents-177981160483]
module.storage.aws_s3_bucket_lifecycle_configuration.documents: Refreshing state... [id=dev-chatbot-documents-177981160483]
module.storage.aws_s3_object.processed_folder: Refreshing state... [id=processed/]
module.storage.aws_s3_object.uploads_folder: Refreshing state... [id=uploads/]
module.websocket_handlers.data.archive_file.connect: Read complete after 5s [id=cdbc8aa76ea66da8b7bbc412ef3ddff69dddbbad]
module.storage.aws_s3_object.failed_folder: Refreshing state... [id=failed/]
module.storage.aws_s3_bucket_policy.documents: Refreshing state... [id=dev-chatbot-documents-177981160483]
module.storage.aws_s3_bucket_server_side_encryption_configuration.documents: Refreshing state... [id=dev-chatbot-documents-177981160483]
module.opensearch_access_config.data.archive_file.configure_access: Read complete after 10s [id=a2fb34821def12aa400f2a8bec8b9ef782d312f0]
module.agentcore.time_sleep.wait_for_runtime_role: Refreshing state... [id=2026-03-17T17:54:24Z]
module.frontend.aws_s3_bucket_server_side_encryption_configuration.frontend: Refreshing state... [id=dev-chatbot-frontend-177981160483]
module.frontend.aws_s3_bucket_policy.frontend: Refreshing state... [id=dev-chatbot-frontend-177981160483]
module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=dev-chatbot-frontend-177981160483]
module.frontend.aws_s3_bucket_lifecycle_configuration.frontend: Refreshing state... [id=dev-chatbot-frontend-177981160483]
module.frontend.aws_s3_bucket_website_configuration.frontend: Refreshing state... [id=dev-chatbot-frontend-177981160483]
module.frontend.aws_s3_bucket_versioning.frontend: Refreshing state... [id=dev-chatbot-frontend-177981160483]
module.frontend.aws_cloudfront_distribution.frontend: Refreshing state... [id=EEGWYQEG3EMUN]
module.monitoring.aws_cloudwatch_metric_alarm.api_gateway_5xx: Refreshing state... [id=dev-chatbot-api-gateway-5xx]
module.monitoring.aws_cloudwatch_metric_alarm.high_latency: Refreshing state... [id=dev-chatbot-high-latency]
module.document_management.data.archive_file.upload: Read complete after 6s [id=625959bd5b146a487ad9e8eb0e02b1b23c9bbb8a]
module.monitoring.aws_cloudwatch_metric_alarm.api_gateway_error_rate: Refreshing state... [id=dev-chatbot-api-error-rate]
module.monitoring.aws_cloudwatch_metric_alarm.bedrock_throttling: Refreshing state... [id=dev-chatbot-bedrock-throttling]
module.monitoring.aws_cloudwatch_metric_alarm.high_error_rate: Refreshing state... [id=dev-chatbot-high-error-rate]
module.monitoring.aws_cloudwatch_metric_alarm.lambda_errors: Refreshing state... [id=dev-chatbot-lambda-errors]
module.monitoring.aws_cloudwatch_metric_alarm.response_time_threshold: Refreshing state... [id=dev-chatbot-response-time-exceeded]
module.chat_history.aws_iam_role_policy.chat_history: Refreshing state... [id=dev-chatbot-chat-history-role:dev-chatbot-chat-history-policy]
module.chat_history.aws_lambda_function.chat_history: Refreshing state... [id=dev-chatbot-chat-history]
module.agent.aws_iam_role_policy.mcp_servers_policy: Refreshing state... [id=dev-agent-mcp-servers-lambda-role:dev-agent-mcp-servers-lambda-policy]
module.agent.aws_iam_role_policy.agent_execution_policy: Refreshing state... [id=dev-agent-execution-role:dev-agent-execution-policy]
module.auth.aws_iam_role_policy.logout_policy: Refreshing state... [id=dev-logout-lambda-role:dev-logout-lambda-policy]
module.auth.aws_iam_role_policy.authorizer_policy: Refreshing state... [id=dev-authorizer-lambda-role:dev-authorizer-lambda-policy]
module.auth.aws_iam_role_policy.login_policy: Refreshing state... [id=dev-login-lambda-role:dev-login-lambda-policy]
module.document_management.aws_iam_role_policy.list_policy: Refreshing state... [id=dev-document-list-lambda-role:dev-document-list-lambda-policy]
module.auth.aws_lambda_function.authorizer: Refreshing state... [id=dev-api-authorizer]
module.websocket_handlers.aws_iam_role_policy.connect_policy: Refreshing state... [id=dev-websocket-connect-role:dev-websocket-connect-policy]
module.websocket_handlers.aws_iam_role_policy.disconnect_policy: Refreshing state... [id=dev-websocket-disconnect-role:dev-websocket-disconnect-policy]
module.websocket_handlers.aws_lambda_function.connect: Refreshing state... [id=dev-websocket-connect]
module.websocket_handlers.aws_lambda_function.disconnect: Refreshing state... [id=dev-websocket-disconnect]
module.cache.aws_security_group.redis: Refreshing state... [id=sg-06c207b1983b4e69d]
module.document_management.aws_iam_role_policy.upload_policy: Refreshing state... [id=dev-document-upload-lambda-role:dev-document-upload-lambda-policy]
module.document_processor.aws_iam_role_policy.generate_embeddings: Refreshing state... [id=dev-chatbot-generate-embeddings-role:dev-chatbot-generate-embeddings-policy]
module.document_processor.aws_iam_role_policy.document_processor: Refreshing state... [id=dev-chatbot-document-processor-role:dev-chatbot-document-processor-policy]
module.chat_history.aws_cloudwatch_log_group.chat_history: Refreshing state... [id=/aws/lambda/dev-chatbot-chat-history]
module.auth.aws_cloudwatch_log_group.authorizer_logs: Refreshing state... [id=/aws/lambda/dev-api-authorizer]
module.cache.aws_elasticache_replication_group.redis: Refreshing state... [id=dev-chatbot-redis]
module.opensearch.aws_opensearch_domain.main: Refreshing state... [id=arn:aws:es:us-east-2:177981160483:domain/dev-chatbot-opensearch]
module.websocket_handlers.aws_cloudwatch_log_group.connect_logs: Refreshing state... [id=/aws/lambda/dev-websocket-connect]
module.agent.aws_lambda_function.mcp_servers: Refreshing state... [id=dev-agent-mcp-servers]
module.rest_api.aws_api_gateway_integration_response.mcp_servers_options: Refreshing state... [id=agir-gv1ucj9hg9-7okatu-OPTIONS-200]
module.rest_api.aws_api_gateway_integration_response.mcp_servers_name_options: Refreshing state... [id=agir-gv1ucj9hg9-h71wsf-OPTIONS-200]
module.rest_api.aws_api_gateway_integration_response.login_options: Refreshing state... [id=agir-gv1ucj9hg9-iwuklo-OPTIONS-200]
module.storage.aws_s3_bucket_cors_configuration.documents: Refreshing state... [id=dev-chatbot-documents-177981160483]
module.rest_api.aws_api_gateway_integration_response.documents_upload_options: Refreshing state... [id=agir-gv1ucj9hg9-uc8stx-OPTIONS-200]
module.rest_api.aws_api_gateway_integration_response.documents_id_options: Refreshing state... [id=agir-gv1ucj9hg9-z89vc1-OPTIONS-200]
module.rest_api.aws_api_gateway_integration_response.logout_options: Refreshing state... [id=agir-gv1ucj9hg9-jnnedc-OPTIONS-200]
module.websocket_handlers.data.archive_file.message: Read complete after 7s [id=9b464e450a6348c57ff605029e1a7c26ea43b41b]
module.rest_api.aws_api_gateway_integration_response.documents_options: Refreshing state... [id=agir-gv1ucj9hg9-fu4c5j-OPTIONS-200]
module.rest_api.aws_api_gateway_integration_response.chat_history_options: Refreshing state... [id=agir-gv1ucj9hg9-flm1kk-OPTIONS-200]
module.document_management.aws_lambda_function.list: Refreshing state... [id=dev-document-list]
module.auth.aws_lambda_function.logout: Refreshing state... [id=dev-auth-logout]
module.auth.aws_lambda_function.login: Refreshing state... [id=dev-auth-login]
module.document_management.aws_lambda_function.upload: Refreshing state... [id=dev-document-upload]
module.websocket_handlers.aws_cloudwatch_log_group.disconnect_logs: Refreshing state... [id=/aws/lambda/dev-websocket-disconnect]
module.rest_api.aws_lambda_permission.chat_history: Refreshing state... [id=AllowAPIGatewayInvoke]
module.agent.aws_cloudwatch_log_group.mcp_servers_logs: Refreshing state... [id=/aws/lambda/dev-agent-mcp-servers]
module.websocket.aws_apigatewayv2_authorizer.websocket: Refreshing state... [id=danp7z]
module.rest_api.aws_api_gateway_authorizer.lambda: Refreshing state... [id=nmt8q1]
module.rest_api.aws_iam_role_policy.api_gateway_authorizer: Refreshing state... [id=dev-api-gateway-authorizer-role:dev-api-gateway-authorizer-policy]
module.websocket.aws_lambda_permission.authorizer: Refreshing state... [id=AllowAPIGatewayInvoke]
module.document_management.aws_cloudwatch_log_group.list_logs: Refreshing state... [id=/aws/lambda/dev-document-list]
module.websocket.aws_lambda_permission.connect: Refreshing state... [id=AllowAPIGatewayInvoke]
module.websocket.aws_apigatewayv2_integration.connect: Refreshing state... [id=p3w4uq2]
module.auth.aws_cloudwatch_log_group.logout_logs: Refreshing state... [id=/aws/lambda/dev-auth-logout]
module.auth.aws_cloudwatch_log_group.login_logs: Refreshing state... [id=/aws/lambda/dev-auth-login]
module.websocket.aws_lambda_permission.disconnect: Refreshing state... [id=AllowAPIGatewayInvoke]
module.websocket.aws_apigatewayv2_integration.disconnect: Refreshing state... [id=svcr6qg]
module.rest_api.aws_api_gateway_method.chat_history: Refreshing state... [id=agm-gv1ucj9hg9-flm1kk-GET]
module.rest_api.aws_api_gateway_method.documents_upload: Refreshing state... [id=agm-gv1ucj9hg9-uc8stx-POST]
module.rest_api.aws_api_gateway_method.mcp_servers_delete: Refreshing state... [id=agm-gv1ucj9hg9-h71wsf-DELETE]
module.rest_api.aws_api_gateway_method.documents_list: Refreshing state... [id=agm-gv1ucj9hg9-fu4c5j-GET]
module.rest_api.aws_api_gateway_method.logout: Refreshing state... [id=agm-gv1ucj9hg9-jnnedc-POST]
module.rest_api.aws_api_gateway_method.mcp_servers_list: Refreshing state... [id=agm-gv1ucj9hg9-7okatu-GET]
module.rest_api.aws_api_gateway_method.documents_delete: Refreshing state... [id=agm-gv1ucj9hg9-z89vc1-DELETE]
module.rest_api.aws_api_gateway_method.mcp_servers_upsert: Refreshing state... [id=agm-gv1ucj9hg9-h71wsf-PUT]
module.rest_api.aws_lambda_permission.mcp_servers: Refreshing state... [id=AllowAPIGatewayInvoke]
module.vector_store_init.aws_iam_role_policy.init_index_policy: Refreshing state... [id=dev-vector-store-init-role:dev-vector-store-init-policy]
module.document_management.aws_iam_role_policy.delete_policy: Refreshing state... [id=dev-document-delete-lambda-role:dev-document-delete-lambda-policy]
module.opensearch_access_config.aws_iam_role_policy.configure_access_policy: Refreshing state... [id=dev-opensearch-configure-access-role:dev-opensearch-configure-access-policy]
module.websocket_handlers.aws_iam_role_policy.message_policy: Refreshing state... [id=dev-websocket-message-role:dev-websocket-message-policy]
module.agentcore.aws_iam_role_policy.gateway_tools_policy: Refreshing state... [id=dev-agentcore-gateway-tools-role:dev-agentcore-gateway-tools-policy]
module.document_management.aws_lambda_function.delete: Refreshing state... [id=dev-document-delete]
module.agentcore.aws_lambda_function.gateway_tools: Refreshing state... [id=dev-agentcore-gateway-tools]
module.vector_store_init.aws_lambda_function.init_index: Refreshing state... [id=dev-vector-store-init-index]
module.document_processor.aws_lambda_function.generate_embeddings: Refreshing state... [id=dev-chatbot-generate-embeddings]
module.document_management.aws_cloudwatch_log_group.upload_logs: Refreshing state... [id=/aws/lambda/dev-document-upload]
module.opensearch_access_config.aws_lambda_function.configure_access: Refreshing state... [id=dev-opensearch-configure-access]
module.rest_api.aws_api_gateway_integration.chat_history: Refreshing state... [id=agi-gv1ucj9hg9-flm1kk-GET]
module.rest_api.aws_lambda_permission.document_list: Refreshing state... [id=AllowAPIGatewayInvoke]
module.websocket.aws_apigatewayv2_route.connect: Refreshing state... [id=co3i5ec]
module.rest_api.aws_api_gateway_integration.mcp_servers_delete: Refreshing state... [id=agi-gv1ucj9hg9-h71wsf-DELETE]
module.websocket.aws_apigatewayv2_route.disconnect: Refreshing state... [id=r8sy1s8]
module.rest_api.aws_lambda_permission.logout: Refreshing state... [id=AllowAPIGatewayInvoke]
module.rest_api.aws_api_gateway_integration.logout: Refreshing state... [id=agi-gv1ucj9hg9-jnnedc-POST]
module.rest_api.aws_api_gateway_integration.mcp_servers_list: Refreshing state... [id=agi-gv1ucj9hg9-7okatu-GET]
module.rest_api.aws_api_gateway_integration.documents_list: Refreshing state... [id=agi-gv1ucj9hg9-fu4c5j-GET]
module.rest_api.aws_api_gateway_integration.login: Refreshing state... [id=agi-gv1ucj9hg9-iwuklo-POST]
module.rest_api.aws_lambda_permission.login: Refreshing state... [id=AllowAPIGatewayInvoke]
module.document_management.aws_cloudwatch_log_group.delete_logs: Refreshing state... [id=/aws/lambda/dev-document-delete]
module.agentcore.aws_iam_role_policy.gateway_policy: Refreshing state... [id=dev-agentcore-gateway-role:dev-agentcore-gateway-policy]
module.agentcore.aws_cloudwatch_log_group.gateway_tools_logs: Refreshing state... [id=/aws/lambda/dev-agentcore-gateway-tools]
module.opensearch_access_config.aws_cloudwatch_log_group.configure_access_logs: Refreshing state... [id=/aws/lambda/dev-opensearch-configure-access]
module.document_processor.aws_iam_role_policy.document_processor_invoke_embeddings: Refreshing state... [id=dev-chatbot-document-processor-role:dev-chatbot-document-processor-invoke-embeddings]
module.document_processor.aws_cloudwatch_log_group.generate_embeddings: Refreshing state... [id=/aws/lambda/dev-chatbot-generate-embeddings]
module.document_processor.aws_lambda_function.document_processor: Refreshing state... [id=dev-chatbot-document-processor]
module.vector_store_init.aws_cloudwatch_log_group.init_index_logs: Refreshing state... [id=/aws/lambda/dev-vector-store-init-index]
module.rest_api.aws_lambda_permission.document_upload: Refreshing state... [id=AllowAPIGatewayInvoke]
module.rest_api.aws_api_gateway_integration.documents_upload: Refreshing state... [id=agi-gv1ucj9hg9-uc8stx-POST]
module.agentcore.time_sleep.wait_for_gateway_role: Refreshing state... [id=2026-03-17T17:42:17Z]
module.rest_api.aws_api_gateway_integration.documents_delete: Refreshing state... [id=agi-gv1ucj9hg9-z89vc1-DELETE]
module.rest_api.aws_lambda_permission.document_delete: Refreshing state... [id=AllowAPIGatewayInvoke]
module.agentcore.aws_bedrockagentcore_gateway.this: Refreshing state... [name=dev-agentcore-gateway]
module.document_processor.aws_lambda_permission.allow_s3_invoke: Refreshing state... [id=AllowS3Invoke]
module.document_processor.aws_s3_bucket_notification.document_upload: Refreshing state... [id=dev-chatbot-documents-177981160483]
module.agentcore.aws_bedrockagentcore_gateway_target.serpapi: Refreshing state... [name=dev-serpapi-mcp]
module.agentcore.aws_bedrockagentcore_gateway_target.builtin_tools: Refreshing state... [name=dev-builtin-tools]
module.websocket_handlers.aws_lambda_function.message: Refreshing state... [id=dev-websocket-message]
module.websocket.aws_lambda_permission.message: Refreshing state... [id=AllowAPIGatewayInvoke]
module.websocket.aws_apigatewayv2_integration.message: Refreshing state... [id=css9edg]
module.websocket_handlers.aws_cloudwatch_log_group.message_logs: Refreshing state... [id=/aws/lambda/dev-websocket-message]
module.websocket.aws_apigatewayv2_route.message: Refreshing state... [id=9kj6zzq]
module.rest_api.aws_api_gateway_integration.mcp_servers_upsert: Refreshing state... [id=agi-gv1ucj9hg9-h71wsf-PUT]
module.rest_api.aws_wafv2_web_acl_logging_configuration.api_gateway[0]: Refreshing state... [id=arn:aws:wafv2:us-east-2:177981160483:regional/webacl/dev-chatbot-api-waf/d7bee265-19cd-421c-babc-6aeb894a3042]
module.rest_api.aws_api_gateway_deployment.chatbot: Refreshing state... [id=nk7h3p]
module.rest_api.aws_api_gateway_stage.chatbot: Refreshing state... [id=ags-gv1ucj9hg9-dev]
module.rest_api.aws_wafv2_web_acl_association.api_gateway[0]: Refreshing state... [id=arn:aws:wafv2:us-east-2:177981160483:regional/webacl/dev-chatbot-api-waf/d7bee265-19cd-421c-babc-6aeb894a3042,arn:aws:apigateway:us-east-2::/restapis/gv1ucj9hg9/stages/dev]
module.rest_api.aws_api_gateway_method_settings.chatbot: Refreshing state... [id=gv1ucj9hg9-dev-*/*]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.agent.aws_lambda_function.mcp_servers will be updated in-place
  ~ resource "aws_lambda_function" "mcp_servers" {
      ~ filename                       = "modules/agent/../../../lambda/agent/mcp-servers/dist/index.zip" -> "./.terraform/lambda/agent-mcp-servers.zip"
        id                             = "dev-agent-mcp-servers"
      ~ last_modified                  = "2026-03-15T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "Fzca1vqSUOhq9XAUmzull80n/uBNTnkxNqAe41RxMIQ=" -> "vCXXKTQP84O27xL91exsbooPAU+yc+Rjv5MHA9v47SE="
        tags                           = {
            "Name" = "dev-agent-mcp-servers"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.agentcore.aws_bedrockagentcore_agent_runtime.this will be created
  + resource "aws_bedrockagentcore_agent_runtime" "this" {
      + agent_runtime_arn         = (known after apply)
      + agent_runtime_id          = (known after apply)
      + agent_runtime_name        = "dev_agentcore_runtime"
      + agent_runtime_version     = (known after apply)
      + description               = "AgentCore Runtime for dev — Strands Agent container"
      + environment_variables     = {
          + "AGENTCORE_GATEWAY_ID"   = "dev-agentcore-gateway-mhfyszyhak"
          + "AGENTCORE_MEMORY_ID"    = "dev_agentcore_memory-i5bLkYCVKx"
          + "AGENT_FOUNDATION_MODEL" = "amazon.nova-pro-v1:0"
          + "AGENT_MAX_ITERATIONS"   = "10"
          + "ENVIRONMENT"            = "dev"
        }
      + lifecycle_configuration   = (known after apply)
      + region                    = "us-east-2"
      + role_arn                  = "arn:aws:iam::177981160483:role/dev-agentcore-runtime-role"
      + tags                      = {
          + "Name" = "dev-agentcore-runtime"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-agentcore-runtime"
          + "Project"     = "Nivulauta Agent"
        }
      + workload_identity_details = (known after apply)

      + agent_runtime_artifact {
          + container_configuration {
              + container_uri = "177981160483.dkr.ecr.us-east-2.amazonaws.com/dev-agentcore-runtime:latest"
            }
        }

      + network_configuration {
          + network_mode = "PUBLIC"
        }

      + protocol_configuration {
          + server_protocol = "HTTP"
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.agentcore.aws_bedrockagentcore_gateway_target.serpapi will be updated in-place
  ~ resource "aws_bedrockagentcore_gateway_target" "serpapi" {
        name               = "dev-serpapi-mcp"
        # (4 unchanged attributes hidden)

      ~ target_configuration {
          ~ mcp {
              ~ mcp_server {
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change. The value is unchanged.
                  ~ endpoint = (sensitive value)
                }
            }
        }
    }

  # module.agentcore.aws_lambda_function.gateway_tools will be updated in-place
  ~ resource "aws_lambda_function" "gateway_tools" {
      ~ filename                       = "modules/agentcore/../../../lambda/agentcore/gateway-tools/dist/index.zip" -> "./.terraform/lambda/agentcore-gateway-tools.zip"
        id                             = "dev-agentcore-gateway-tools"
      ~ last_modified                  = "2026-03-17T16:39:23.802+0000" -> (known after apply)
      ~ source_code_hash               = "BZTirIfPCFO2utJX/dadwWl57PlxMEOhvd7kT4VO0cs=" -> "RhwGp2a/zYqWQbSJ1tKYTVX37v0TjkvZawrmxSZsAyg="
        tags                           = {
            "Name" = "dev-agentcore-gateway-tools"
        }
        # (29 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.auth.aws_lambda_function.authorizer will be updated in-place
  ~ resource "aws_lambda_function" "authorizer" {
      ~ filename                       = "modules/auth/../../../lambda/auth/authorizer/dist/index.zip" -> "./.terraform/lambda/auth-authorizer.zip"
        id                             = "dev-api-authorizer"
      ~ last_modified                  = "2026-03-15T08:57:44.878+0000" -> (known after apply)
      ~ source_code_hash               = "T4hmgZACd7JF57INujsIsTrhwCeTLz2sdj9RcVrhMXE=" -> "YRCYATYHyxq+ef41WnWAKRjW55kftSOPL5f/9Q529x8="
        tags                           = {
            "Name" = "dev-api-authorizer"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.auth.aws_lambda_function.login will be updated in-place
  ~ resource "aws_lambda_function" "login" {
      ~ filename                       = "modules/auth/../../../lambda/auth/login/dist/index.zip" -> "./.terraform/lambda/auth-login.zip"
        id                             = "dev-auth-login"
      ~ last_modified                  = "2026-03-15T08:58:10.151+0000" -> (known after apply)
      ~ source_code_hash               = "p/5MJ8RN4ogoVFn5gmdkfg96bgclIt8+ZtgkTf+qQCg=" -> "hpo9Y/UkbDzH5wirPmxh+o8BVixun7llrYSOjrlGb+U="
        tags                           = {
            "Name" = "dev-auth-login"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.auth.aws_lambda_function.logout will be updated in-place
  ~ resource "aws_lambda_function" "logout" {
      ~ filename                       = "modules/auth/../../../lambda/auth/logout/dist/index.zip" -> "./.terraform/lambda/auth-logout.zip"
        id                             = "dev-auth-logout"
      ~ last_modified                  = "2026-03-15T08:58:10.150+0000" -> (known after apply)
      ~ source_code_hash               = "IjkUi4rHCh5oXYCwSZOd5dN0/gPTXf8AS1f65NvsIDI=" -> "sqBpR1lfi0VpH7VJPmnUT86aGibWpyikLV3DLgzTVeY="
        tags                           = {
            "Name" = "dev-auth-logout"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.chat_history.aws_lambda_function.chat_history will be updated in-place
  ~ resource "aws_lambda_function" "chat_history" {
        id                             = "dev-chatbot-chat-history"
      ~ last_modified                  = "2026-03-15T08:57:44.778+0000" -> (known after apply)
      ~ source_code_hash               = "3BTVAH6W/n/2XweUvXmlaGl356ulMPXMMIrqfb9kIHc=" -> "+/Ki3tzOv1HpcpkSZRPxtbI1a5pDy+Wa9I71+f4Yc9k="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "dev-chatbot-chat-history"
        }
        # (30 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.document_management.aws_lambda_function.delete will be updated in-place
  ~ resource "aws_lambda_function" "delete" {
      ~ filename                       = "modules/document-management/../../../lambda/documents/delete/dist/index.zip" -> "./.terraform/lambda/document-delete.zip"
        id                             = "dev-document-delete"
      ~ last_modified                  = "2026-03-15T08:58:10.154+0000" -> (known after apply)
      ~ source_code_hash               = "o5RVFSjH6wW1asamr1wY5224LdeBTXVjJh2eJuzWkLI=" -> "UbLYVKjqR2NCgDaRFkwmyvE5kn4Myh8WqPfK2pli5Xk="
        tags                           = {
            "Name" = "dev-document-delete"
        }
        # (29 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.document_management.aws_lambda_function.list will be updated in-place
  ~ resource "aws_lambda_function" "list" {
      ~ filename                       = "modules/document-management/../../../lambda/documents/list/dist/index.zip" -> "./.terraform/lambda/document-list.zip"
        id                             = "dev-document-list"
      ~ last_modified                  = "2026-03-15T08:58:10.149+0000" -> (known after apply)
      ~ source_code_hash               = "MxfQqbV6jIEI+H3YgVOo7oD8RhwI/zdf103AJJvFYT8=" -> "TiMxY4ybshxycIngOIDRCRuB2YMV6Cd+N7qEEuXR0tE="
        tags                           = {
            "Name" = "dev-document-list"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.document_management.aws_lambda_function.upload will be updated in-place
  ~ resource "aws_lambda_function" "upload" {
      ~ filename                       = "modules/document-management/../../../lambda/documents/upload/dist/index.zip" -> "./.terraform/lambda/document-upload.zip"
        id                             = "dev-document-upload"
      ~ last_modified                  = "2026-03-15T08:58:10.165+0000" -> (known after apply)
      ~ source_code_hash               = "ILqT0YH0EszpxtLxiuGLZ5Jldq7/mpOUCMKfkm4L3eg=" -> "ho9yG4Rf4RKqHbUyFkrx0DsiNt9GcwNJV2MZt/591KI="
        tags                           = {
            "Name" = "dev-document-upload"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.document_processor.aws_lambda_function.document_processor will be updated in-place
  ~ resource "aws_lambda_function" "document_processor" {
        id                             = "dev-chatbot-document-processor"
      ~ last_modified                  = "2026-03-15T08:57:48.108+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:177981160483:layer:dev-chatbot-document-processor-deps:4",
        ] -> (known after apply)
      ~ source_code_hash               = "Syaqvg9rujYupII0uHUgJLAyzvYOahO1cq7WolDWtVs=" -> "+PG9JD1qtomzNgmcHQo/n4Dhf41RTv+e1TmkwSAluGY="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "dev-chatbot-document-processor"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.document_processor.aws_lambda_function.generate_embeddings will be updated in-place
  ~ resource "aws_lambda_function" "generate_embeddings" {
        id                             = "dev-chatbot-generate-embeddings"
      ~ last_modified                  = "2026-03-15T08:57:47.325+0000" -> (known after apply)
      ~ source_code_hash               = "3eM60oN7KglDsS4o+U3Z+EBavYaBTfFVDBi7sFcQOVw=" -> "0DCxLtbtjRnzequvvq/FFWSCUHGdmWIsqNzY9VZ+ADs="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "dev-chatbot-generate-embeddings"
        }
        # (30 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.document_processor.aws_lambda_layer_version.document_processor_dependencies will be created
  + resource "aws_lambda_layer_version" "document_processor_dependencies" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.11",
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + description                 = "Dependencies for document processor: pdfplumber, tiktoken, boto3"
      + filename                    = "./.terraform/lambda/document-processor-layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "dev-chatbot-document-processor-deps"
      + region                      = "us-east-2"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "PWhuziyiSgcqTi/VCohb6XzVXoUVXBXUd/B6VXJX4t0="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.opensearch_access_config.aws_lambda_function.configure_access will be updated in-place
  ~ resource "aws_lambda_function" "configure_access" {
      ~ filename                       = "modules/opensearch-access-config/../../../lambda/vector-store/configure-access/dist/configure-access.zip" -> "./.terraform/lambda/configure-access.zip"
        id                             = "dev-opensearch-configure-access"
      ~ last_modified                  = "2026-03-17T22:55:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "OB5voPNEB9BDbfze3ZpNIh6STeZiy11u/1RlaVtVZk4=" -> "6Vk8I2UI+tHq6AHRkh0+n/B+I0Pu69sstYjRUxs2ydM="
        tags                           = {
            "Name" = "dev-opensearch-configure-access"
        }
        # (29 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vector_store_init.aws_lambda_function.init_index will be updated in-place
  ~ resource "aws_lambda_function" "init_index" {
      ~ filename                       = "modules/vector-store-init/../../../lambda/vector-store/init-index/dist/index.zip" -> "./.terraform/lambda/vector-store-init-index.zip"
        id                             = "dev-vector-store-init-index"
      ~ last_modified                  = "2026-03-15T08:57:41.270+0000" -> (known after apply)
      ~ source_code_hash               = "wjW98c23zE+DKkZoepwVo+d3IAPGC5vDrorLD1VNYaI=" -> "lz5RY4Z+jMwpBjIooueOI9/9puQHTFaeNuqNf6NqdSc="
        tags                           = {
            "Name" = "dev-vector-store-init-index"
        }
        # (29 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.websocket_handlers.aws_lambda_function.connect will be updated in-place
  ~ resource "aws_lambda_function" "connect" {
      ~ filename                       = "modules/websocket-handlers/../../../lambda/websocket/connect/dist/index.zip" -> "./.terraform/lambda/websocket-connect.zip"
        id                             = "dev-websocket-connect"
      ~ last_modified                  = "2026-03-15T08:57:44.714+0000" -> (known after apply)
      ~ source_code_hash               = "k64xofx67Df2Ja/UQ/eJVvFFW94WIayYyAOPGMM0wug=" -> "ynjPo6tBHDw9dnUMIe77HAlURm2BhOMvUVNZi0D/N3M="
        tags                           = {
            "Name" = "dev-websocket-connect"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.websocket_handlers.aws_lambda_function.disconnect will be updated in-place
  ~ resource "aws_lambda_function" "disconnect" {
      ~ filename                       = "modules/websocket-handlers/../../../lambda/websocket/disconnect/dist/index.zip" -> "./.terraform/lambda/websocket-disconnect.zip"
        id                             = "dev-websocket-disconnect"
      ~ last_modified                  = "2026-03-15T08:57:44.735+0000" -> (known after apply)
      ~ source_code_hash               = "8TukCl0aumB77wWbxZfMgHWL4yBE8fk9ZJX0LjvRoZA=" -> "3CPP85cTAZgziSUCMMciAEroy+Jtv7Q1UcrfkuIYwhU="
        tags                           = {
            "Name" = "dev-websocket-disconnect"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.websocket_handlers.aws_lambda_function.message will be updated in-place
  ~ resource "aws_lambda_function" "message" {
      ~ filename                       = "modules/websocket-handlers/../../../lambda/websocket/message/dist/index.zip" -> "./.terraform/lambda/websocket-message.zip"
        id                             = "dev-websocket-message"
      ~ last_modified                  = "2026-03-16T13:47:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "OHUpg/1+UwuSoByGfD9iY6rWfr5etlQ8fTxwOGVEBp4=" -> "JSlQWJ/vqQlgTKAOJcG6JSR9eGw0Dupy2Occiw6RnII="
        tags                           = {
            "Name" = "dev-websocket-message"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "AGENT_FOUNDATION_MODEL"  = "amazon.nova-pro-v1:0"
              - "AGENT_MAX_ITERATIONS"    = "10"
              - "CACHE_HOST"              = "dev-chatbot-redis.dqyha7.ng.0001.use2.cache.amazonaws.com"
              - "CACHE_PORT"              = "6379"
              - "CHAT_HISTORY_TABLE"      = "dev-chatbot-chat-history"
              - "CONNECTIONS_TABLE"       = "dev-chatbot-connections"
              - "DOCUMENT_METADATA_TABLE" = "dev-chatbot-document-metadata"
              - "KMS_KEY_ID"              = "arn:aws:kms:us-east-2:177981160483:key/5464812d-92bc-4993-9605-984d3b23623e"
              - "MCP_SERVER_CONFIG_TABLE" = "dev-chatbot-mcp-server-config"
              - "OPENSEARCH_ENDPOINT"     = "vpc-dev-chatbot-opensearch-yjxm4m364xen7fsdw5pszvka3a.us-east-2.es.amazonaws.com"
              - "RATE_LIMITS_TABLE"       = "dev-chatbot-rate-limits"
              - "USE_BEDROCK_AGENT"       = "true"
              - "WEBSOCKET_API_ID"        = "ftj9zrh5h0"
            } -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 17 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Pushed by: @christopher-h-johnson*